app/controllers/contact_types_controller.rb

  def index
    @contact_types = ContactType.all
---
SELECT "contact_types".* FROM "contact_types"

  def update
    respond_to do |format|
      if @contact_type.update(contact_type_params)
---
UPDATE "contact_types" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "contact_types"."id" = 1  [["description", "Person who as already purchased"], ["name", "Client"], ["updated_at", "2014-07-30 23:34:56.727919"]]

    def set_contact_type
      @contact_type = ContactType.find(params[:id])
---
SELECT  "contact_types".* FROM "contact_types"  WHERE "contact_types"."id" = ? LIMIT 1  [["id", 1]]