app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("birth_date", "city", "created_at", "email", "first_name", "height", "last_name", "primary_number", "secondary_number", "state", "street_address1", "street_address2", "type_id", "updated_at", "weight", "zip_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "birth_date" = ?, "city" = ?, "email" = ?, "height" = ?, "last_name" = ?, "primary_number" = ?, "secondary_number" = ?, "state" = ?, "street_address1" = ?, "street_address2" = ?, "updated_at" = ?, "zip_code" = ? WHERE "contacts"."id" = 1

  def destroy
    @contact.destroy
---
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]