app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
---
  def index
    @exercises = Exercise.all

INSERT INTO "exercises" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-31 03:00:52.866441"], ["description", "standing on a bench"], ["name", "bench stand"], ["updated_at", "2014-07-31 03:00:52.866441"]]
---
  def create
    @exercise = Exercise.new(exercise_params)

    respond_to do |format|
      if @exercise.save

SELECT  "exercises".* FROM "exercises"  WHERE "exercises"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_exercise
      @exercise = Exercise.find(params[:id])