app/controllers/routines_controller.rb

  def index
    @routines = Routine.all
---
SELECT "routines".* FROM "routines"

  def create
    @routine = Routine.new(routine_params)

    respond_to do |format|
      if @routine.save
---
INSERT INTO "routines" ("created_at", "date_created", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-30 23:19:12.369680"], ["date_created", "2014-07-30 23:18:00.000000"], ["name", "test"], ["updated_at", "2014-07-30 23:19:12.369680"]]

  def destroy
    @routine.destroy
---
DELETE FROM "routines" WHERE "routines"."id" = ?  [["id", 1]]

    def set_routine
      @routine = Routine.find(params[:id])
---
SELECT  "routines".* FROM "routines"  WHERE "routines"."id" = ? LIMIT 1  [["id", 1]]